#ifndef IND_FUNCS_H
#define IND_FUNCS_H

#include <iostream>

using namespace std;


// Включить новый элемент после i-го по номеру элемента.
// Включить новый элемент после элемента с заданным ключом
// Включить новый элемент перед i-ым по номеру элементом
// Включить новый элемент перед элементом с заданным ключом.
// Включить новый элемент вместо i-го по номеру элемента.
// Включить новый элемент вместо элемента с соответствующим ключом.
// Исключить элемент перед i-ым по номеру элементом
// Исключить элемент перед элементом с заданным ключом.
// Исключить элемент после i-го по номеру элемента.
// Исключить элемент после элемента с заданным ключом
// Исключить i-ый по номеру элемент.
// Исключить элемент с соответствующим ключом.
// Поменять местами i-ый и i-1 по номерам элементы.
// Поменять местами i-ый и i+1 по номерам элементы.
// Поменять местами i-ый и j-ый по номерам элементы.
// Поменять местами элемент с заданным ключом и следующий.
// Поменять местами элемент с заданным ключом и предыдущий.
// Поменять местами два элемента с заданными ключами.
// Первый элемент переставить в конец списка.
// Последний элемент переставить в начало списка.
// Упорядочить список по возрастанию ключей.
// Отпечатать все элементы после i-го.
// Отпечатать все элементы, у которых значения ключей попадают в заданный диапазон.
// Вставить элемент в упорядоченный список согласно значению ключа, не нарушая упорядочения.
// Удалить из списка элементы, значения ключей которых меньше среднего арифметического значения всех значений ключей.


#endif
